while (<>) {
  s/{([^{}]|(?0))*}//g;
  s/\[([^\[\]]|(?0))*]//g;

  s/\(([^()]|(?0))*\)//g;

  $_=lc "$_ ";
  s/²/2/g;
  s/<[^>]+>/ /g;
  s/<\/[^>]+>/ /g;
  s/³/3/g;
  s/"+/"/g;
   s/<[^>]+>[^<]*<\/[^>]+>/ /g;
  s/°/ độ /g;
  s/—/-/g;
  s/[^\|]+\|([^\|]+)/$1/g;
  s/[^\|]+\|([^\|]+)/$1/g;
  s/[^\|]+\|([^\|]+)/$1/g;
  s/[^\|]+\|([^\|]+)/$1/g;
  s/%/ phần trăm /g;
  
  s/0/ không /g;
  s/1/ một /g;
  s/2/ hai /g;
  s/3/ ba /g;
  s/4/ bốn /g;
  s/5/ năm /g;
  s/6/ sáu /g;
  s/7/ bảy /g;
  s/8/ tám /g;
  s/9/ chín /g;
  s/ö/o/g;
  s/[^\naáàảãạăaáàảãạăắằẳẵặâấầẩẫậbcdđeéèẻẽẹêếềểễệfghiíìỉĩịjklmnoóòỏõọôốồổỗộơớờởỡợpqrstuúùủũụưứừửữựvwxyýỳỷỹỵz ]/ /g;
  s/[ ]+/ /g;
  s/\n[ ]*/ /g;
  print $_;
}
